app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 16 Aug 2011 11:50:42 UTC +00:00], ["updated_at", Tue, 16 Aug 2011 11:50:42 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart = Cart.find(params[:id])