app/controllers/line_items_controller.rb

  def edit
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "4"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 16 Aug 2011 13:15:58 UTC +00:00], ["updated_at", Tue, 16 Aug 2011 13:15:58 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 72], ["created_at", Wed, 17 Aug 2011 14:44:40 UTC +00:00], ["order_id", nil], ["product_id", 4], ["quantity", 1], ["updated_at", Wed, 17 Aug 2011 14:44:40 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2011-08-16 13:33:16.506916' WHERE "line_items"."id" = 46

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "219"]]

  def destroy
    @line_item = LineItem.find(params[:id])
    @cart = @line_item.cart
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 66]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 4]]

  def decrement
    @line_item = LineItem.find(params[:id])
    if @line_item.quantity > 1
      @line_item.quantity -= 1
    else
      @line_item.destroy
    end
    @line_item.save
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "219"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 219]]
UPDATE "line_items" SET "quantity" = 5, "updated_at" = '2011-08-17 13:36:08.849649' WHERE "line_items"."id" = 219

  def increment
    @line_item = LineItem.find(params[:id])
    @line_item.quantity += 1
    @line_item.save
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "220"]]
UPDATE "line_items" SET "quantity" = 8, "updated_at" = '2011-08-17 13:40:28.580970' WHERE "line_items"."id" = 220