app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at_desc LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate :page => params[:page], :order => "created_at desc", :per_page => 10

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 75
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 75
---
  def new
    @order = Order.new

    @cart = current_cart
    if @cart.line_items.empty?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 18 Aug 2011 08:00:49 UTC +00:00], ["updated_at", Thu, 18 Aug 2011 08:00:49 UTC +00:00]]
INSERT INTO "orders" ("addresse", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 82]]
---
  def create
    @order = Order.new(params[:order])
    @cart = current_cart
    @order.add_line_items_from_cart(@cart)


    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "5"]]
---
  def update
    @order = Order.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 3]]
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy