app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  def index
    @products = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "6"]]
---
  def show
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "6"]]
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "6"]]
UPDATE "products" SET "description" = 'lorem ipsuim testa lorem ipsuim testa lorem ipsuim testa lorem ipsuim testa lorem ipsuim testa lorem ipsuim testa testa', "updated_at" = '2011-08-16 08:00:27.722490' WHERE "products"."id" = 6
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "4"]]
---
  def who_bought
    @product = Product.find(params[:id])