app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY name

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "hasched_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "name" = 'jim,', "salt" = '384697800.5554400448618361', "hasched_password" = '55bad983cd9fc58956e94ed53717688d4cd301c4d57b86c7cd65271ecf4868d9', "updated_at" = '2011-08-18 12:46:52.614059' WHERE "users"."id" = 980190962

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]